# Вход:
# От конзолата се четат 3 реда:
#  Първи ред – броят процесори, които трябва да се изработят – 
# цяло число в интервала [1...500 000]
#  Втори ред – броят служители – цяло число в интервала [1...1000]
#  Трети ред – работните дни – цяло число в интервала [1...1000]
# Изход:
# На конзолата трябва да се отпечата текст, спрямо броя на изработените процесори:
#  Ако са повече или колкото плануваните:
# o "Profit: -> {печалби} BGN"
#  Ако са по-малко от плануваните:
# o "Losses: -> {загуби} BGN"
# Сумите трябва да са форматирани до втория знак след десетичната запетая.


cpu_pcs = int(input())
people = int(input())
work_days = int(input())

cpu_made =  ((people * work_days) * 8) // 3



profit = (abs(cpu_made - cpu_pcs) * 110.10)

if cpu_made >= cpu_pcs:
    print(f"Profit: -> {profit:.2f} BGN")
else:
    print(f"Losses: -> {profit:.2f} BGN")